// AnimBlueprintGeneratedClass BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C
// Size: 0x2730 (Inherited: 0x690)
struct UBP_Anim_CaptainScott_Base_C : UNPCAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x690(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_2CD902C24C5DD3C39E917B945B6173A8; // 0x698(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_501CBE584F221B63A5C652AFAD438A7A; // 0x6e0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_61ACD28F4CA54F78F664D79BFB91AA16; // 0x728(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7; // 0x770(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41; // 0x7b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335; // 0x7f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C; // 0x830(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5; // 0x870(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AFE99B244EDF78E44038A687CE9DACD7; // 0x8b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB; // 0x8f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8A25DCAC47B44029B70F88AF3F5A5C54; // 0x930(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B; // 0x970(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4610264341D118917106CD823FFFF791; // 0x9b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C; // 0x9f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68; // 0xa30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5; // 0xa70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA; // 0xab0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51; // 0xaf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B26560374147BD1FF497FA98EFD1F5EF; // 0xb30(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_BC6BB45B4E7D2C0D8723258D745E8F6B; // 0xb70(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_05BE548B4AB21BE8EC9899B205D19AAF; // 0xbd0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A3258A6E475175DA5E5D5EAEB7FA8DD2; // 0xc18(0x40)
	struct FAnimNode_Root AnimGraphNode_StateResult_994E3755478BD24BF35FA29984048D95; // 0xc58(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4EA1D06D42AADA9624806CB41C54169F; // 0xca0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_269309D3407497D6420FD886C69BE95B; // 0xd00(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1BF85A6D4F34291B0796AA924E39C764; // 0xd48(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B18FE85B4ADCBEAB2174A7857612C92D; // 0xda8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_341236BF4A81EBAA5A49EDB86EC42020; // 0xdf0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_674A6619431A6BBD4596DABD67671419; // 0xe98(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1DFB56E349429EAE648DCB8577FE7359; // 0xee0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_86A6275B4A5BA192F44B0FA218DF6A6A; // 0xf40(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615; // 0xf88(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942; // 0xfc8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C847221C47174F2EB5537E830D340172; // 0x1008(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6673CFE14C2EE62CCE3294A742F35812; // 0x1068(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9BDDC1784A786667F076899525374D5B; // 0x10b0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_4F05CBB143B076B163966AA6906E1FB9; // 0x1110(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D238362B487C43917B613DBA962EEC64; // 0x1158(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_B40EA37F4A864F9446DE8997ECE0B8F5; // 0x1200(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7A16BCAE43C41D8BAFB0BF8D05B0ABF1; // 0x1248(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AC3CBAAC4C827FD479924A86438256D2; // 0x12a8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F; // 0x12f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B; // 0x1330(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39CF6ACE4B49135D300212AF6CD8574C; // 0x1370(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_D77106F5421C70FDBB57609104AB457F; // 0x13d0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_09547AC4474E920370C08B9CCA7EDEFA; // 0x1418(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_DBBA67C647C2061BFA1797AFE9BF99E0; // 0x1478(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4015BE5C46E0BF7E41E53C9658B209E1; // 0x14c0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_8354546645EA8B119354CEA64CC8BDC0; // 0x1568(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_1C81DEF947DCD048E856BA89D9EB2426; // 0x15b0(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24991954444F19A213E58B8DC6CF9505; // 0x1658(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_54B77A6F494C7E192928C6A04D63A294; // 0x1708(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_782FC44A4BA050844B1E08A3CF584C1D; // 0x1768(0xb0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_82B1100244DADFF3445C41BD2C2627EC; // 0x1818(0x70)
	struct FAnimNode_Slot AnimGraphNode_Slot_C87D1D604B3866AD395251BB86701BC1; // 0x1888(0x60)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_B0BB37374633BDD4F923679649B531B4; // 0x18e8(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_D301208C468DE0860DE1BD931CA2CCEB; // 0x1920(0x90)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_943177854BEF4E336470CCAA758E8367; // 0x19b0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_860F348747CFCD9E6CD7D8AD530A6BA6; // 0x1a60(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4458DC0C4876AFE7F47F01A4B3EE64F9; // 0x1aa8(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8F84B4D74ADE646FBD60DD91B35E43A5; // 0x1b38(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7D5AF0BA4B2BF4691EAFAB9A1FEDBE19; // 0x1b80(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_EE9EBDFC4FAF4489CC6414907A29A0C7; // 0x1bc8(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot_5539331E4F2F8789177120BC4298A37E; // 0x1c00(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_40EE09364CBF9F1B6514C2BF3C74DDA5; // 0x1c60(0x70)
	struct FAnimNode_LookAt AnimGraphNode_LookAt_96FB33B943BE924F22D4CE91913E09BA; // 0x1cd0(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8D47F06140EF28269D342693F64D5138; // 0x1d90(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_DC8E73264068DAAC4BA234B87217505B; // 0x1df0(0x70)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8D29F36546937AF8ECE06C9A73649AB5; // 0x1e60(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_C38A3C1E41471AD7EA3E3B96276A997B; // 0x1ea8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_15168AEB4BF9E41F3C75318CF6C11682; // 0x1ef0(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_E4A556274698A1BD643F508807EE1643; // 0x1f50(0x70)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D5E19CB94C98D23F96F595B9C04E6A92; // 0x1fc0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_F2AAB046408E6CA0AA0B29936B85516A; // 0x2060(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_E52554C84B10A6449FBB97850C2BE50C; // 0x20c0(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_0D963207499A7822FBB178A026D624AE; // 0x2150(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3161F6C345092E9E40FC94A517E831D7; // 0x2198(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_313BE00E4C71172584AA9A923DED4166; // 0x21f8(0x60)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_987640204F2F7E4373BF48A0ED95F6F6; // 0x2258(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_D617ED194736E8F11C6FAA810C498F5E; // 0x22a8(0x90)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4DCAA68C4014B93486B393A06B88E875; // 0x2338(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0EE933D14C69F43ABE6B2189B20B6EAE; // 0x2380(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11A583A44A391F3B21831087C0A45F0C; // 0x23c8(0x70)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1E8D3B034D8FCE8D9A1CA78A5C3EDC2B; // 0x2438(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85DF0F4A44D5267A66881584130AA9BE; // 0x2498(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E87CAC38462EB2263F5999B9F62A32FA; // 0x2548(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_EAB7F21F43B791E0C2C11F915D5D7B23; // 0x25e8(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_010DCEBC43D3CB2CA74A818FE8151304; // 0x2678(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_FB57BE024BB219386DF7A6A3F1CFAFCA; // 0x26c0(0x48)
	bool AnimgraphStarted; // 0x2708(0x01)
	bool IsPhased; // 0x2709(0x01)
	bool ManualHeadLookAt; // 0x270a(0x01)
	bool Is Playing Sequencer Anim; // 0x270b(0x01)
	float SequencerBlendWeight; // 0x270c(0x04)
	float AnimationBlendWeight; // 0x2710(0x04)
	float FacialOverride; // 0x2714(0x04)
	float LookAtActivationSpeed; // 0x2718(0x04)
	float LookAtTargetPositionSpeed; // 0x271c(0x04)
	float Look At Clamp; // 0x2720(0x04)
	float HeadRotationX; // 0x2724(0x04)
	float HeadRotationY; // 0x2728(0x04)
	float HeadRotationZ; // 0x272c(0x04)

	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_BlendListByBool_943177854BEF4E336470CCAA758E8367(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_BlendListByBool_943177854BEF4E336470CCAA758E8367 // BlueprintEvent // @ game+0x18e3b10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_ModifyBone_D617ED194736E8F11C6FAA810C498F5E(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_ModifyBone_D617ED194736E8F11C6FAA810C498F5E // BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_StartLookat(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_StartLookat // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_StopLookAt(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_StopLookAt // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_IdleVariantChange(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_IdleVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_InactiveVariantChange(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_InactiveVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_InteractVariantChange(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_InteractVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void BlueprintInitializeAnimation(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_NPCLookAtOn(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_NPCLookAtOn // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_NPCLookAtOff(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_NPCLookAtOff // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredNull(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredNull // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredOneShot(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredOneShot // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredContinuousOut(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredContinuousOut // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredContinuousLoopB(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredContinuousLoopB // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredContinuousLoopA(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredContinuousLoopA // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_EnteredContinuousIn(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_EnteredContinuousIn // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_NPCSelectNewCustomAnim_B(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_NPCSelectNewCustomAnim_B // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_NPCSelectNewCustomAnim_A(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_NPCSelectNewCustomAnim_A // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_NPCDeactivateCustomAnimSequence(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_NPCDeactivateCustomAnimSequence // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_DetachSocketB(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_DetachSocketB(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_DetachSocketA(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_DetachSocketA(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_11(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_10(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_9(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_8(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_7(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_6(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_11(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_10(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_9(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_8(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_7(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_6(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_AttachItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_AttachItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_DetachItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_DetachItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_DestroyItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_5(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_4(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_3(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_RH_UseItem_2(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_RH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_DestroyItem(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_5(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_4(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_3(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void AnimNotify_LH_UseItem_2(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.AnimNotify_LH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void ExecuteUbergraph_BP_Anim_CaptainScott_Base(int32_t EntryPoint); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.ExecuteUbergraph_BP_Anim_CaptainScott_Base //  // @ game+0x18e3b10
};

