// BlueprintGeneratedClass BP_EmissaryTable_01.BP_EmissaryTable_01_C
// Size: 0x6e8 (Inherited: 0x690)
struct ABP_EmissaryTable_01_C : AEmissaryVoteInteractionActor {
	struct UEmissaryActiveTableVisualiserComponent* EmissaryActiveTableVisualiser; // 0x690(0x08)
	struct UVoteAudioComponent* VoteAudio; // 0x698(0x08)
	struct UStaticMeshVoteVisualiserComponent* StaticMeshVoteVisualiser; // 0x6a0(0x08)
	struct UInlineVotingInteractionComponent* InlineVotingInteraction; // 0x6a8(0x08)
	struct UActionRulesComponent* ActionRules; // 0x6b0(0x08)
	struct UStaticMeshComponent* VoteIndicator4; // 0x6b8(0x08)
	struct UStaticMeshComponent* VoteIndicator3; // 0x6c0(0x08)
	struct UStaticMeshComponent* VoteIndicator2; // 0x6c8(0x08)
	struct UStaticMeshComponent* VoteIndicator1; // 0x6d0(0x08)
	struct UStaticMeshComponent* bld_emissary_table_01_a; // 0x6d8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x6e0(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_01.BP_EmissaryTable_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

