// BlueprintGeneratedClass BP_EmissaryTable_MerchantAlliance_01.BP_EmissaryTable_MerchantAlliance_01_C
// Size: 0x760 (Inherited: 0x6e8)
struct ABP_EmissaryTable_MerchantAlliance_01_C : ABP_EmissaryTable_01_C {
	struct UPointLightComponent* PointLight1; // 0x6e8(0x08)
	struct UPointLightComponent* PointLight; // 0x6f0(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x700(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x708(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x710(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x730(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x738(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a; // 0x740(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_01_a; // 0x748(0x08)
	struct UStaticMeshComponent* bld_emissary_table_dressing_mrh_01_a; // 0x750(0x08)
	struct UStaticMeshComponent* con_cover_page_mrh_01_a; // 0x758(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_MerchantAlliance_01.BP_EmissaryTable_MerchantAlliance_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

