// BlueprintGeneratedClass BP_EmissaryTable_OrderOfSouls_01.BP_EmissaryTable_OrderOfSouls_01_C
// Size: 0x758 (Inherited: 0x6e8)
struct ABP_EmissaryTable_OrderOfSouls_01_C : ABP_EmissaryTable_01_C {
	struct UPointLightComponent* PointLight; // 0x6e8(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x6f0(0x08)
	struct UParticleSystemComponent* vfx_enchanting_open_chest_ambient; // 0x6f8(0x08)
	struct UStaticMeshComponent* con_cover_page_oos_01_a; // 0x700(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_07_a; // 0x708(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_08_a; // 0x710(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_05_a; // 0x718(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_03_a; // 0x720(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_02_a; // 0x728(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a1; // 0x730(0x08)
	struct UStaticMeshComponent* cap_cabin_books_02_a; // 0x738(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a; // 0x740(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_02_a; // 0x748(0x08)
	struct UStaticMeshComponent* cap_desk_model_oos_01_a; // 0x750(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_OrderOfSouls_01.BP_EmissaryTable_OrderOfSouls_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

