// BlueprintGeneratedClass BP_FactionEmissaryTable_Athena.BP_FactionEmissaryTable_Athena_C
// Size: 0x7b0 (Inherited: 0x6e8)
struct ABP_FactionEmissaryTable_Athena_C : ABP_EmissaryTable_01_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6e8(0x08)
	struct UPointLightComponent* PointLight3; // 0x6f0(0x08)
	struct UStaticMeshComponent* cap_desk_model_fac_shield_athena_01_a; // 0x6f8(0x08)
	struct UPointLightComponent* PointLight2; // 0x700(0x08)
	struct UPointLightComponent* PointLight1; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x710(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x718(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x730(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x738(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x740(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x760(0x08)
	struct UStaticMeshComponent* Hourglass; // 0x768(0x08)
	struct UStaticMeshComponent* HourglassStand; // 0x770(0x08)
	struct UStaticMeshComponent* con_cover_page_leg_01_a_02; // 0x778(0x08)
	struct UChildActorComponent* FactionLeaveVote; // 0x780(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x788(0x08)
	struct UStaticMeshComponent* con_cover_page_leg_01_a; // 0x790(0x08)
	struct UStaticMeshComponent* cap_desk_model_leg_01_a; // 0x798(0x08)
	struct UStaticMesh* NewTableMesh; // 0x7a0(0x08)
	struct UMaterialInstanceDynamic* HourglassGlassMaterial; // 0x7a8(0x08)

	void UserConstructionScript(); // Function BP_FactionEmissaryTable_Athena.BP_FactionEmissaryTable_Athena_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void ReceiveBeginPlay(); // Function BP_FactionEmissaryTable_Athena.BP_FactionEmissaryTable_Athena_C.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x18e3b10
	void ExecuteUbergraph_BP_FactionEmissaryTable_Athena(int32_t EntryPoint); // Function BP_FactionEmissaryTable_Athena.BP_FactionEmissaryTable_Athena_C.ExecuteUbergraph_BP_FactionEmissaryTable_Athena //  // @ game+0x18e3b10
};

