// BlueprintGeneratedClass BP_LargeShip_QuestTable.BP_LargeShip_QuestTable_C
// Size: 0x980 (Inherited: 0x928)
struct ABP_LargeShip_QuestTable_C : AVoyageTable {
	struct UChildActorComponent* CancelVoyageSeaOfThievesOnDemand; // 0x928(0x08)
	struct UChildActorComponent* WarMap; // 0x930(0x08)
	struct UChildActorComponent* FactionHourglass; // 0x938(0x08)
	struct UChildActorComponent* CancelAdventure; // 0x940(0x08)
	struct UChildActorComponent* PlayerBuiredItemsMapBundleInteractionPoint; // 0x948(0x08)
	struct UChildActorComponent* CancelTale; // 0x950(0x08)
	struct UChildActorComponent* CancelVoyage; // 0x958(0x08)
	struct UChildActorComponent* VoyageSelectionSlot4; // 0x960(0x08)
	struct UChildActorComponent* VoyageSelectionSlot3; // 0x968(0x08)
	struct UChildActorComponent* VoyageSelectionSlot2; // 0x970(0x08)
	struct UChildActorComponent* VoyageSelectionSlot1; // 0x978(0x08)

	void UserConstructionScript(); // Function BP_LargeShip_QuestTable.BP_LargeShip_QuestTable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

