// BlueprintGeneratedClass BP_mojo_bld_scottcharter_01_a.BP_mojo_bld_scottcharter_01_a_C
// Size: 0x6b8 (Inherited: 0x3c8)
struct ABP_mojo_bld_scottcharter_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3e0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x3e8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x3f0(0x08)
	struct USpotLightComponent* SpotLight; // 0x3f8(0x08)
	struct UBoxComponent* Box Collision 03; // 0x400(0x08)
	struct UBoxComponent* Box Collision 02; // 0x408(0x08)
	struct UBoxComponent* Box Collision 01; // 0x410(0x08)
	struct UStaticMeshComponent* cmn_barrel_debris_04_a1; // 0x418(0x08)
	struct UDecalComponent* Decal; // 0x420(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a7; // 0x428(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a22; // 0x430(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a6; // 0x438(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a21; // 0x440(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a20; // 0x448(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a5; // 0x450(0x08)
	struct UStaticMeshComponent* mojo_bld_scottcharter_board_01_a; // 0x458(0x08)
	struct UStaticMeshComponent* mojo_bld_scottcharter_rope_01_a; // 0x460(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a5; // 0x468(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a4; // 0x470(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a3; // 0x478(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a2; // 0x480(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a1; // 0x488(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a; // 0x490(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a19; // 0x498(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a18; // 0x4a0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a17; // 0x4a8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a16; // 0x4b0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a15; // 0x4b8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a14; // 0x4c0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a13; // 0x4c8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a12; // 0x4d0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a11; // 0x4d8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a10; // 0x4e0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a9; // 0x4e8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a8; // 0x4f0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a7; // 0x4f8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a6; // 0x500(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a5; // 0x508(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a4; // 0x510(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a3; // 0x518(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a2; // 0x520(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a1; // 0x528(0x08)
	struct UStaticMeshComponent* cmn_rope_end_04_a; // 0x530(0x08)
	struct UStaticMeshComponent* cmn_rope_04_c1; // 0x538(0x08)
	struct UStaticMeshComponent* wsp_wood_support_01_c1; // 0x540(0x08)
	struct UStaticMeshComponent* wsp_wood_support_01_c; // 0x548(0x08)
	struct UStaticMeshComponent* cmn_rope_end_01_a2; // 0x550(0x08)
	struct UStaticMeshComponent* wpn_dagger_01_a; // 0x558(0x08)
	struct UPointLightComponent* PointLight; // 0x560(0x08)
	struct UStaticMeshComponent* tls_wld_orb_light_c; // 0x568(0x08)
	struct UBoxComponent* Box Collision; // 0x570(0x08)
	struct UPointLightComponent* PointLight1; // 0x578(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a6; // 0x580(0x08)
	struct UStaticMeshComponent* gmp_Map_MadMonk_b; // 0x588(0x08)
	struct UStaticMeshComponent* tls_lantern_01_e; // 0x590(0x08)
	struct UStaticMeshComponent* tls_tankard_smp_01_a1; // 0x598(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a4; // 0x5a0(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a2; // 0x5a8(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a3; // 0x5b0(0x08)
	struct UStaticMeshComponent* mojo_bld_scottcharter_cloth_02_a; // 0x5b8(0x08)
	struct UStaticMeshComponent* cmn_rope_end_01_a1; // 0x5c0(0x08)
	struct UStaticMeshComponent* cmn_rope_end_01_a; // 0x5c8(0x08)
	struct UStaticMeshComponent* cmn_beacon_wood_01_d2; // 0x5d0(0x08)
	struct UStaticMeshComponent* cmn_beacon_wood_01_d1; // 0x5d8(0x08)
	struct UStaticMeshComponent* cmn_beacon_wood_01_d; // 0x5e0(0x08)
	struct UStaticMeshComponent* cmn_boots_03_a_L1; // 0x5e8(0x08)
	struct UStaticMeshComponent* cmn_boots_03_a_L; // 0x5f0(0x08)
	struct UStaticMeshComponent* tls_tankard_smp_01_a; // 0x5f8(0x08)
	struct UStaticMeshComponent* cmn_wheel_01_a__cmn_wheel_01_a; // 0x600(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a5; // 0x608(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a4; // 0x610(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a3; // 0x618(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a2; // 0x620(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a1; // 0x628(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a; // 0x630(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_04_a2; // 0x638(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_04_a1; // 0x640(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_04_a; // 0x648(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a1; // 0x650(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_03_a; // 0x658(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_01_a1; // 0x660(0x08)
	struct UStaticMeshComponent* shp_wreck_plank_01_a; // 0x668(0x08)
	struct UStaticMeshComponent* mojo_bld_scottcharter_cloth_01_a; // 0x670(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a1; // 0x678(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a; // 0x680(0x08)
	struct UStaticMeshComponent* cmn_rowboat_boat_01_a; // 0x688(0x08)
	struct UStaticMeshComponent* cmn_bucket_01_a; // 0x690(0x08)
	struct UStaticMeshComponent* cmn_barrel_salvage_01_e1; // 0x698(0x08)
	struct UStaticMeshComponent* cmn_barrel_salvage_01_e; // 0x6a0(0x08)
	struct UStaticMeshComponent* cmn_barrel_debris_04_a; // 0x6a8(0x08)
	struct USceneComponent* SharedRoot; // 0x6b0(0x08)

	void UserConstructionScript(); // Function BP_mojo_bld_scottcharter_01_a.BP_mojo_bld_scottcharter_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

