// BlueprintGeneratedClass BP_prem_shop_wsp_closed_01_a.BP_prem_shop_wsp_closed_01_a_C
// Size: 0x488 (Inherited: 0x3c8)
struct ABP_prem_shop_wsp_closed_01_a_C : AActor {
	struct UBoxComponent* Box; // 0x3c8(0x08)
	struct UTritonComponent* Triton; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x408(0x08)
	struct UStaticMeshComponent* bld_prem_shop_plunder_details_01_a; // 0x410(0x08)
	struct UStaticMeshComponent* bld_prem_shop_01_a; // 0x418(0x08)
	struct UStaticMeshComponent* bld_pot_shop_door_frame_01_a1; // 0x420(0x08)
	struct UStaticMeshComponent* bld_shops_closed_boards_01_a; // 0x428(0x08)
	struct UStaticMeshComponent* bld_pot_shop_roof_beam_01_a; // 0x430(0x08)
	struct UStaticMeshComponent* bld_pot_shop_chimney_01_a; // 0x438(0x08)
	struct UStaticMeshComponent* bld_pot_gate_01_a; // 0x440(0x08)
	struct UStaticMeshComponent* bld_pot_fence_01_a; // 0x448(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a3; // 0x450(0x08)
	struct UStaticMeshComponent* bld_pot_hatch_01_a; // 0x458(0x08)
	struct UStaticMeshComponent* bld_pot_shop_door_01_a; // 0x460(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a2; // 0x468(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a1; // 0x470(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a; // 0x478(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x480(0x08)

	void UserConstructionScript(); // Function BP_prem_shop_wsp_closed_01_a.BP_prem_shop_wsp_closed_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

