// BlueprintGeneratedClass BP_ShroudedDeep_MerrickShip_Rocks.BP_ShroudedDeep_MerrickShip_Rocks_C
// Size: 0x5a0 (Inherited: 0x3c8)
struct ABP_ShroudedDeep_MerrickShip_Rocks_C : AActor {
	struct UStaticMeshComponent* StaticMesh44; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh43; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh41; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh40; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh39; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh38; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh37; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh36; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x498(0x08)
	struct UStaticMeshComponent* und_kelp_plant_01_b; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x4a8(0x08)
	struct UStaticMeshComponent* und_kelp_plant_02_b; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x4b8(0x08)
	struct UStaticMeshComponent* und_kelp_plant_04_b; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x4f8(0x08)
	struct UStaticMeshComponent* wsp_small_stalagmite_02; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x528(0x08)
	struct UStaticMeshComponent* wsp_rock_cave_stalagmite_cluster_smll_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x538(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_a1; // 0x540(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_f1; // 0x548(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_f; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x558(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_e; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x568(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_c; // 0x570(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_a; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x580(0x08)
	struct UStaticMeshComponent* wsp_sea_rocks_b; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x590(0x08)
	struct USceneComponent* SharedRoot; // 0x598(0x08)

	void UserConstructionScript(); // Function BP_ShroudedDeep_MerrickShip_Rocks.BP_ShroudedDeep_MerrickShip_Rocks_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

