// BlueprintGeneratedClass BP_SovereignHut_Table.BP_SovereignHut_Table_C
// Size: 0x448 (Inherited: 0x3c8)
struct ABP_SovereignHut_Table_C : AActor {
	struct UPointLightComponent* PointLight; // 0x3c8(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x3d0(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x3d8(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x3e0(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x3e8(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x3f0(0x08)
	struct UStaticMeshComponent* Candle5; // 0x3f8(0x08)
	struct UStaticMeshComponent* Candle4; // 0x400(0x08)
	struct UStaticMeshComponent* Candle3; // 0x408(0x08)
	struct UStaticMeshComponent* Candle2; // 0x410(0x08)
	struct UStaticMeshComponent* Candle1; // 0x418(0x08)
	struct UStaticMeshComponent* Candlestick; // 0x420(0x08)
	struct UStaticMeshComponent* Inkwell; // 0x428(0x08)
	struct UStaticMeshComponent* Ship Model; // 0x430(0x08)
	struct UStaticMeshComponent* Table; // 0x438(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x440(0x08)

	void UserConstructionScript(); // Function BP_SovereignHut_Table.BP_SovereignHut_Table_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

