// BlueprintGeneratedClass BP_SOTOnDemand_Shady_MerchantAllianceShop.BP_SOTOnDemand_Shady_MerchantAllianceShop_C
// Size: 0x728 (Inherited: 0x6e0)
struct ABP_SOTOnDemand_Shady_MerchantAllianceShop_C : ACompanyShopkeeper {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x6e8(0x08)
	struct UCapsuleComponent* SolidHits; // 0x6f0(0x08)
	struct UNPCDialogComponent* NPCDialogSellCrate; // 0x6f8(0x08)
	struct UNPCDialogComponent* NPCDialog; // 0x700(0x08)
	struct UMerchantCrateProviderComponent* MerchantCrateProvider; // 0x708(0x08)
	struct USkeletalMeshComponent* cmp_pocket_watch_mrh_01_e; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x718(0x08)
	struct UAnimNotifyWwiseEmitterComponent* AnimNotifyWwiseEmitter; // 0x720(0x08)

	void UserConstructionScript(); // Function BP_SOTOnDemand_Shady_MerchantAllianceShop.BP_SOTOnDemand_Shady_MerchantAllianceShop_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void PlayItemAnimation(); // Function BP_SOTOnDemand_Shady_MerchantAllianceShop.BP_SOTOnDemand_Shady_MerchantAllianceShop_C.PlayItemAnimation // Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
	void ExecuteUbergraph_BP_SOTOnDemand_Shady_MerchantAllianceShop(int32_t EntryPoint); // Function BP_SOTOnDemand_Shady_MerchantAllianceShop.BP_SOTOnDemand_Shady_MerchantAllianceShop_C.ExecuteUbergraph_BP_SOTOnDemand_Shady_MerchantAllianceShop //  // @ game+0x18e3b10
};

