// BlueprintGeneratedClass wsp_tree_cluster_01_a.wsp_tree_cluster_01_a_C
// Size: 0x470 (Inherited: 0x408)
struct Awsp_tree_cluster_01_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_bush_cheese_01_a2; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_cheese_01_a1; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_bush_fern_01_a; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_bush_cheese_01_a; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_bush_07_a_02; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_bush_07_a_01; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_c2_1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_b2_1; // 0x440(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_b3_1; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_a3_1; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_a2_1; // 0x460(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_a2_1; // 0x468(0x08)

	void UserConstructionScript(); // Function wsp_tree_cluster_01_a.wsp_tree_cluster_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x18e3b10
};

